Autodesk.Revit.DB.Architecture.StairsPathType.FullStepArrow
True if the arrow fills the full step width, false if it fills by the specified arrow size.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.StartFromRiser
True if the stairs path starts from the riser, false if it starts from the tread.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The StairsPathType is not fixed up direction so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.ShowArrowheadToCutMark
True if the stairs path arrowhead should be shown to the cutmark, false if the arrow head is not shown.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.DrawForEachRun
True if stairs paths should be drawn for each run, false if it should be drawn for the whole stairs.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The StairsPathType is not fixed up direction so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.EndAtRiser
Represents whether the stairs path ends at the riser.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The StairsPathType is not fixed up direction so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.StartSymbolTypeId
The start symbol type of stairs path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The startSymbolTypeId is not a valid start symbol type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.StairsPathDirection
The style of the stairs path.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.LineShapeAtCorner
The line shape of stairs path at the corner.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Either the stairs path direction is not AutomaticUpDown, or it is AlwaysUp but DrawForEachRun is false.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.ArrowheadTypeId
The arrow head type of the stairs path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The arrowheadTypeId is not a valid arrow head type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.StartExtension
The start extension length of the stairs path.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for startExtension must be between 0 and 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType.DistanceToCutMark
The distance from the stairs path arrow to cut mark.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for distanceToCutMark must be between 0 and 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsPathType
An object represents the stairs path type.
Since:
2013